# -*- coding: utf-8 -*-
"""
Created on Fri Dec  9 15:49:32 2022

@author: CC
"""



#####以下是诊断标准及打分的正太分布的参数####

VIS={32:[32,3.2],46:[46,4.6],68:[68,6.8],100:[120,50],150:[150,15],220:[220,22],320:[320,32]}

AW={'rest':[0.8,0.3],'油膜轴承':[200,150]}

NAS={'All':[8,1]}

Fe_Turbine={'Fe(70~100um)':[80,30],'Fe(100~150um)':[30,10],'Fe(>150um)':[10,3],\
            'nFe(200~300um)':[50,20],'nFe(300~400um)':[20,10],'nFe(>400um)':[10,3]}

Fe_Hydraulic={'Fe(70~100um)':[80,30],'Fe(100~150um)':[30,10],'Fe(>150um)':[10,3],\
            'nFe(200~300um)':[50,20],'nFe(300~400um)':[20,10],'nFe(>400um)':[10,3]}

Fe_gear={'Fe(70~100um)':[800,300],'Fe(100~150um)':[300,100],'Fe(>150um)':[100,30],\
          'nFe(200~300um)':[500,200],'nFe(300~400um)':[200,100],'nFe(>400um)':[100,30]}

    
####权重######
Weight={'VIS':0.3,'AW':0.2,'NAS':0.2,'Fe_NFe':0.3}

para_set=[VIS,AW,NAS,Fe_Turbine,Fe_Hydraulic,Fe_gear]


####结论标签#####

# Conclusion={'黏度不平稳':'黏度序列不平稳，表明导致油膜强度不稳，局部油膜被击穿的概率增加；建议关注黏度变化情况。',
#             '黏度上升':'可能由于油温下降导致；建议持续观察。',
#             '黏度下降':'由于温度下降导致：建议持续观察。',
#             '油温偏高': '油温偏高，表明系统可能存在冷却水流量不足或摩擦副异常磨损；建议检查设备运行情况。',
#             '油温上升': '油温上升，表明系统可能存在冷却水流量不足或摩擦副异常磨损；建议关注设备运行情况。',
#             '黏温性能异常': '说明油液黏度随温度变化异常，应注意油液黏温，建议加测黏度指数。',
#             '水分偏高':'含水量偏高，可能存在冷却水泄漏；建议关注水分变化情况，检查邮箱底部是否存在游离水或乳化液，必要时采取脱水处理。',
#             '含水量下降':'含水量下降，可能由于油液分水性导致油中部分水分分离；建议检查邮箱底部是否存在游离水或乳化液。',
#             '含水量上升':'含水量上升，可能由于密封不严导致外部空气水分浸入，或存在冷却水泄漏；建议关注水分变化情况。',
#             '污染度等级偏高':'污染度等级偏高，可能由于密封不严导致外部粉尘进入；建议加强过滤净化处理。',
#             '污染度上升':'污染度等级偏高，可能由于密封不严导致外部粉尘进入；建议加强过滤净化处理。',
#             '铁磁颗粒含量偏高':'油中铁磁颗粒含量偏高，表明系统存在异常磨损,如传动轴、泵等；建议检查设备运行情况。',
#             '铁磁颗粒含量上升':'油中铁磁颗粒含量有上升趋势，表明系统存在异常磨损,如传动轴、泵等；建议检查设备运行情况。',
#             '非铁磁颗粒含量偏高':'油中非铁磁颗粒含量偏高，表明系统可能存在异常磨损，如传动轴瓦、铜片等；建议检查设备运行情况。',
#             '非铁磁颗粒含量上升': '油中非铁磁颗粒含量有上升趋势，表明系统存在异常磨损,如传动轴瓦、铜片等；建议检查设备运行情况。',
#             '黏度偏高':'黏度偏高，可能由于油温上升导致，建议送检离线，关注黏度变化趋势。'}



Conclusion={'Vis_unsmo':['黏度不平稳','黏度序列不平稳，表明导致油膜强度不稳，局部油膜被击穿的概率增加；建议关注黏度变化情况。'],
            'Vis_up':['黏度上升','可能由于油温下降导致；建议持续观察。'],
            'Vis_down':['黏度下降','由于温度下降导致：建议持续观察。'],
            'Temp_high': ['油温偏高','表明系统可能存在冷却水流量不足或摩擦副异常磨损；建议检查设备运行情况。'],
            'Temp_up': ['油温上升','表明系统可能存在冷却水流量不足或摩擦副异常磨损；建议关注设备运行情况。'],
            'Vis_Temp_unnorm':['黏温性能异常','说明油液黏度随温度变化异常，应注意油液黏温，建议加测黏度指数。'],
            'water_high':['水分偏高','含水量偏高，可能存在冷却水泄漏；建议关注水分变化情况，检查邮箱底部是否存在游离水或乳化液，必要时采取脱水处理。'],
            'water_down':['含水量下降','含水量下降，可能由于油液分水性导致油中部分水分分离；建议检查邮箱底部是否存在游离水或乳化液。'],
            'water_up':['含水量上升','含水量上升，可能由于密封不严导致外部空气水分浸入，或存在冷却水泄漏；建议关注水分变化情况。'],
            'NAS_high':['污染度等级偏高','污染度等级偏高，可能由于密封不严导致外部粉尘进入；建议加强过滤净化处理。'],
            'NAS_up':['污染度上升','污染度等级偏高，可能由于密封不严导致外部粉尘进入；建议加强过滤净化处理。'],
            'Fe_high':['铁磁颗粒含量偏高','油中铁磁颗粒含量偏高，表明系统存在异常磨损,如传动轴、泵等；建议检查设备运行情况。'],
            'Fe_up':['铁磁颗粒含量上升','油中铁磁颗粒含量有上升趋势，表明系统存在异常磨损,如传动轴、泵等；建议检查设备运行情况。'],
            'nFe_high':['非铁磁颗粒含量偏高','油中非铁磁颗粒含量偏高，表明系统可能存在异常磨损，如传动轴瓦、铜片等；建议检查设备运行情况。'],
            'nFe_up':['非铁磁颗粒含量上升', '油中非铁磁颗粒含量有上升趋势，表明系统存在异常磨损,如传动轴瓦、铜片等；建议检查设备运行情况。'],
            'Vis_high':['黏度偏高','黏度偏高，可能由于油温上升导致，建议送检离线，关注黏度变化趋势。'],
            }



para_set={'VIS':VIS,'AW':AW,'NAS':NAS,'Fe_Turbine':Fe_Turbine,'Fe_Hydraulic':Fe_Hydraulic,'Fe_gear':Fe_gear,'Weight':Weight,'Conclusion':Conclusion}

#

#para_set={}



import json    
json.dump(para_set,open('configuration.json','w'),indent=4)


